scrambletools/ESP-AVB-Wireless-AP/sdkconfig.defaults
# ESP-AVB-Bridge defaults — Waveshare ESP32-P4-WiFi6-PoE-ETH (ESP1):
# P4 host owns Ethernet + AVB stack; onboard C6 over SDIO is the Wi-Fi
# coprocessor (built from coprocessor/ via the upstream
# esp-hosted-mcu/slave example overlaid with esp_ptp_rpc).

CONFIG_IDF_TARGET="esp32p4"

# ESP1's P4 silicon is rev v1.3; same pre-v3 boot fix as the example.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

CONFIG_ESP_NETIF_L2_TAP=y
# Bridge needs 4 L2TAP fds per port × 2 ports + 1 for ptpd = 9 minimum.
# Default is 5; bump to the Kconfig max to keep room for future
# additions. (esp_netif's help-text says L2TAP is "currently associated
# only with Ethernet"; if Wi-Fi binding fails functionally we'll fall
# back to a netif-input-callback path on the wireless port.)
CONFIG_ESP_NETIF_L2_TAP_MAX_FDS=10

# Onboard PHY uses the same IP101 footprint as the existing example.
CONFIG_EXAMPLE_USE_INTERNAL_ETHERNET=y
CONFIG_EXAMPLE_ETH_PHY_IP101=y

# Per-port topology — esp_ptp is the single source of truth. The
# matching ESP_AVB_* mirrors (NUM_PORTS, PORTn_MEDIUM_*, ROLE_BRIDGE,
# etc.) are derived in esp_avb/Kconfig.projbuild and follow these.
#   port 0: ethernet  (host_if=emac, bridged, 1 Gbps)
#   port 1: wifi      (host_if=sdio — onboard C6 over ESP-Hosted,
#                      bridged, AP, ~150 Mbps negotiated cap)
# Peer-delay on port 1 comes from 802.11 FTM (external); the AP also
# publishes gPTP FollowUpInformation via beacon Vendor IE.
CONFIG_ESP_PTP_NUM_PORTS=2
CONFIG_ESP_PTP_PORT0_MEDIUM_ETH_HWTS=y
CONFIG_ESP_PTP_PORT0_HOST_IF_EMAC=y
CONFIG_ESP_PTP_PORT0_TYPE_BRIDGED=y
CONFIG_ESP_PTP_PORT0_LINK_SPEED_MBPS=1000
CONFIG_ESP_PTP_PORT1_MEDIUM_WIFI_FTM=y
CONFIG_ESP_PTP_PORT1_HOST_IF_SDIO=y
CONFIG_ESP_PTP_PORT1_TYPE_BRIDGED=y
CONFIG_ESP_PTP_PORT1_WIFI_MODE_AP=y
CONFIG_ESP_PTP_PORT1_LINK_SPEED_MBPS=150

# gPTP intervals matching the example.
CONFIG_ESP_PTP_TIMEOUT_MS=10000
CONFIG_ESP_PTP_SETTIME_THRESHOLD_MS=100
CONFIG_ESP_PTP_SYNC_INTERVAL_MS=125
CONFIG_ESP_PTP_ANNOUNCE_INTERVAL_MS=1000

# AVB Lite stays advertised on the wired side; the bridge runs full
# AVB on Ethernet but Class B on Wi-Fi (Phase 5).
CONFIG_ESP_AVB_AVB_LITE_COMPLIANT=y

# ESP-Hosted SDIO host configuration for the Waveshare
# ESP32-P4-WIFI6-PoE-ETH onboard P4 ↔ C6 bus.
#
# Actual wiring (re-read from the schematic 4-bit SDIO bus, cross-wired
# between P4 host slot-1 IOMUX pins and C6 slave HW-fixed IOMUX pins):
#   Signal  C6 chip pin   P4 chip pin    Net name on schematic
#   CLK     GPIO19        GPIO18          GPIO18
#   CMD     GPIO18        GPIO19          GPIO19
#   D0      GPIO20        GPIO14          GPIO14
#   D1      GPIO21        GPIO15          GPIO15
#   D2      GPIO22        GPIO16          GPIO16
#   D3      GPIO23        GPIO17          GPIO17
# Each line has a 51 kΩ pull-up to ESP_3V3.
#
# CMD/CLK appear "swapped" between host and slave because both ICs
# place those signals on each other's nominal pins — the schematic's
# net names follow the P4 host pin numbers, not the C6 slave's.
#
# Bus width: 4-bit. ESP-Hosted's P4 defaults (slot 1, 4-bit, CMD=19,
# CLK=18, D0..D3=14..17) match this wiring, so we don't override pins.
CONFIG_ESP_HOSTED_ENABLE=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_SDIO_SLOT_1=y
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y

# Peer data transfer / Custom RPC. ESP-Hosted's standard protobuf RPC
# catalogue does not expose esp_wifi_set_vendor_ie (the host-side stub
# at managed_components/.../host/api/src/esp_hosted_api.c is commented
# out, and the locally-linked libnet80211 has no radio behind it). We
# bridge it via this additive channel — host calls
# esp_hosted_send_custom_data(AVB_RPC_MSG_SET_VENDOR_IE_REQ, ...), the
# slave's avb_custom_rpc.c handler invokes esp_wifi_set_vendor_ie()
# locally on the C6. Default upstream is y, set explicitly here to
# pin the value.
CONFIG_ESP_HOSTED_ENABLE_PEER_DATA_TRANSFER=y
CONFIG_ESP_HOSTED_MAX_CUSTOM_MSG_HANDLERS=4

# Restart the P4 when the SDIO transport reports a runtime failure
# (e.g., C6 reset / wedged underneath us). Combined with the
# SLAVE_RESET_ON_EVERY_HOST_BOOTUP knob below, each restart pulses
# GPIO 54 to bring the C6 to a known state, so recovery converges.
CONFIG_ESP_HOSTED_TRANSPORT_RESTART_ON_FAILURE=y

# Pulse the C6 reset GPIO on every host boot. _ONLY_IF_NECESSARY gates
# the GPIO reset on transport_card_init failure, but the observed wedge
# is "card init succeeds, C6 firmware never sends ESP_PRIV_EVENT_INIT" —
# that path doesn't reach the reset branch. Resetting unconditionally
# costs ~1.5 s per boot but covers both dead-controller and
# wedged-slave-firmware cases. The thrash of an associated STA's per-STA
# wifi-driver TX scheduler that this triggers is handled on the endpoint
# side (esp_ptp's TSF-discontinuity detection forces a clean reauth).
CONFIG_ESP_HOSTED_SLAVE_RESET_ON_EVERY_HOST_BOOTUP=y
# CONFIG_ESP_HOSTED_SLAVE_RESET_ONLY_IF_NECESSARY is not set

# Host restarts itself if the slave never sends INIT within the
# configured timeout (default 5 s). Together with the GPIO-reset on
# next boot, this converts "slave wedged" into a self-healing
# reboot/reset cycle rather than silent half-bridge degradation.
CONFIG_ESP_HOSTED_HOST_RESTART_NO_COMMUNICATION_WITH_SLAVE=y

# ISR stack is PER-CORE, so the P4 pays this twice. The previous 6144
# (12 KiB total, 4x the IDF default of 1536) starved RETENT_RAM below
# the threshold sleep_retention_entries_create needs, and the bridge
# boot-looped in sleep_clock_icg_init long before app_main -- a failure
# that reports as "failed to allocate memory for system sleep clock
# ICG" and looks nothing like a RAM shortage. Before raising this,
# check the RETENT_RAM line in the boot log: below ~136 KiB the bridge
# will not boot. CONFIG_ESP_SYSTEM_HW_STACK_GUARD is on, so a
# too-small ISR stack panics immediately rather than corrupting memory.
CONFIG_FREERTOS_ISR_STACKSIZE=2048
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n
CONFIG_ETH_TRANSMIT_MUTEX=n
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_ETH_IRAM_OPTIMIZATION=y
# Bumped from 30 to 64 to absorb Class A AVTP bursts (8000 pps) while
# the bridge RX task drains; 30 overflowed under load.
CONFIG_ETH_DMA_RX_BUFFER_NUM=30
CONFIG_ESP_NETIF_L2_TAP_RX_QUEUE_SIZE=64
CONFIG_ETH_DMA_BUFFER_SIZE=1536
# Bridge Wi-Fi TX path tuning for AVTP forwarding.
# - More TX buffers absorb burst arrivals before the aggregator
#   sends them out.
# - A wide Block-Ack window lets A-MPDU pack many AVTP frames into
#   one PHY transmission, which is what makes high-rate streams
#   fit on 802.11.
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=64
# Max BA window for HT/HE — packs up to 64 frames into one A-MPDU,
# amortising 802.11 per-frame overhead. Chip supports HE so the
# Kconfig range is 2..64; pre-Wi-Fi-6 silicon caps at 32.
CONFIG_ESP_WIFI_TX_BA_WIN=64
# Pin the Wi-Fi work to CPU1. EMAC RX runs at high priority on CPU0
# (where the IDF emac_esp32_rx_task drains the DMA ring); moving the
# Wi-Fi MAC/TX work off CPU0 keeps EMAC RX from being preempted while
# Wi-Fi processes its TX queue.
# CONFIG_ESP_WIFI_TASK_PINNED_TO_CORE_0 is not set
CONFIG_ESP_WIFI_TASK_PINNED_TO_CORE_1=y

# 32 MB stacked PSRAM (ESP32-P4NRW32). Enabled so runtime allocation
# storms land in a 32 MB pool instead of killing the board: internal
# DIRAM is 572 KB and this bridge has already hit two of its cliffs
# (RETENT_RAM starvation at boot, and an episodic >250 KB/s allocation
# burst that exhausted the heap at ~8 s uptime). Small allocations
# (< SPIRAM_MALLOC_ALWAYSINTERNAL, default 16 KB) and anything
# DMA-capable stay internal, so the EMAC/SDIO hot paths are unaffected.
# P4 Kconfig defaults give HEX mode at 200 MHz. IGNORE_NOTFOUND keeps
# a board with unfitted/failed PSRAM booting instead of aborting.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y

# The bridge is an always-on device that never enters light sleep, so
# the sleep-clock ICG retention module is dead weight -- and worse, it
# was the boot cliff: its REGDMA lists allocate from the RETENT_RAM
# window (the low-DIRAM residue left after IRAM code and .data/.bss),
# and whenever static growth squeezed that window below ~136 KiB the
# init function failed ESP_ERR_NO_MEM and cpu_start aborted before
# app_main. Disabling it compiles the module out entirely, removing
# both the allocation and the failure mode. Re-enable only if the
# bridge ever adopts light sleep.
CONFIG_PM_SLEEP_CLK_ICG_ENABLE=n
# Heap component runs from flash (cached XIP): proven under sustained
# 8000 pps forwarding (bpdrop=0), saves ~3 KB of IRAM. Do NOT also move
# FreeRTOS to flash: that configuration died on a spinlock recursion
# assert in the tick hook after ~5 min at line rate.
CONFIG_HEAP_PLACE_FUNCTION_INTO_FLASH=y
